/* automatically generated by rust-bindgen 0.69.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const __BITS_PER_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const __LITTLE_ENDIAN: u32 = 1234;
pub const USB_DIR_OUT: u32 = 0;
pub const USB_DIR_IN: u32 = 128;
pub const USB_TYPE_MASK: u32 = 96;
pub const USB_TYPE_STANDARD: u32 = 0;
pub const USB_TYPE_CLASS: u32 = 32;
pub const USB_TYPE_VENDOR: u32 = 64;
pub const USB_TYPE_RESERVED: u32 = 96;
pub const USB_RECIP_MASK: u32 = 31;
pub const USB_RECIP_DEVICE: u32 = 0;
pub const USB_RECIP_INTERFACE: u32 = 1;

pub const USB_SSP_SUBLINK_SPEED_LSE: u32 = 48;
pub const USB_SSP_SUBLINK_SPEED_LSE_BPS: u32 = 0;
pub const USB_SSP_SUBLINK_SPEED_LSE_KBPS: u32 = 1;
pub const USB_SSP_SUBLINK_SPEED_LSE_MBPS: u32 = 2;
pub const USB_SSP_SUBLINK_SPEED_LSE_GBPS: u32 = 3;
pub const USB_SSP_SUBLINK_SPEED_ST: u32 = 192;
pub const USB_SSP_SUBLINK_SPEED_ST_SYM_RX: u32 = 0;
pub const USB_SSP_SUBLINK_SPEED_ST_ASYM_RX: u32 = 1;
pub const USB_SSP_SUBLINK_SPEED_ST_SYM_TX: u32 = 2;
pub const USB_SSP_SUBLINK_SPEED_ST_ASYM_TX: u32 = 3;
pub const USB_SSP_SUBLINK_SPEED_RSVD: u32 = 16128;
pub const USB_SSP_SUBLINK_SPEED_LP: u32 = 49152;
pub const USB_SSP_SUBLINK_SPEED_LP_SS: u32 = 0;
pub const USB_SSP_SUBLINK_SPEED_LP_SSP: u32 = 1;
pub const USB_SSP_SUBLINK_SPEED_LSM: u32 = 16711680;
pub const USB_PD_POWER_DELIVERY_CAPABILITY: u32 = 6;
pub const USB_PD_BATTERY_INFO_CAPABILITY: u32 = 7;
pub const USB_PD_PD_CONSUMER_PORT_CAPABILITY: u32 = 8;
pub const USB_PD_PD_PROVIDER_PORT_CAPABILITY: u32 = 9;
pub const USB_PD_CAP_BATTERY_CHARGING: u32 = 2;
pub const USB_PD_CAP_USB_PD: u32 = 4;
pub const USB_PD_CAP_PROVIDER: u32 = 8;
pub const USB_PD_CAP_CONSUMER: u32 = 16;
pub const USB_PD_CAP_CHARGING_POLICY: u32 = 32;
pub const USB_PD_CAP_TYPE_C_CURRENT: u32 = 64;
pub const USB_PD_CAP_PWR_AC: u32 = 256;
pub const USB_PD_CAP_PWR_BAT: u32 = 512;
pub const USB_PD_CAP_PWR_USE_V_BUS: u32 = 16384;
pub const USB_PD_CAP_CONSUMER_BC: u32 = 1;
pub const USB_PD_CAP_CONSUMER_PD: u32 = 2;
pub const USB_PD_CAP_CONSUMER_TYPE_C: u32 = 4;
pub const USB_PD_CAP_CONSUMER_UNKNOWN_PEAK_POWER_TIME: u32 = 65535;
pub const USB_PD_CAP_PROVIDER_BC: u32 = 1;
pub const USB_PD_CAP_PROVIDER_PD: u32 = 2;
pub const USB_PD_CAP_PROVIDER_TYPE_C: u32 = 4;
pub const USB_PTM_CAP_TYPE: u32 = 11;
pub const USB_DT_USB_PTM_ID_SIZE: u32 = 3;
pub const USB_ENDPOINT_SWITCH_MASK: u32 = 3;
pub const USB_ENDPOINT_SWITCH_NO: u32 = 0;
pub const USB_ENDPOINT_SWITCH_SWITCH: u32 = 1;
pub const USB_ENDPOINT_SWITCH_SCALE: u32 = 2;
pub const USB3_LPM_DISABLED: u32 = 0;
pub const USB3_LPM_U1_MAX_TIMEOUT: u32 = 127;
pub const USB3_LPM_U2_MAX_TIMEOUT: u32 = 254;
pub const USB3_LPM_DEVICE_INITIATED: u32 = 255;
pub const USB3_LPM_MAX_U1_SEL_PEL: u32 = 255;
pub const USB3_LPM_MAX_U2_SEL_PEL: u32 = 65535;
pub const USB_SELF_POWER_VBUS_MAX_DRAW: u32 = 100;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
#[doc = " struct usb_ctrlrequest - SETUP data for a USB device control request\n @bRequestType: matches the USB bmRequestType field\n @bRequest: matches the USB bRequest field\n @wValue: matches the USB wValue field (le16 byte order)\n @wIndex: matches the USB wIndex field (le16 byte order)\n @wLength: matches the USB wLength field (le16 byte order)\n\n This structure is used to send control requests to a USB device.  It matches\n the different fields of the USB 2.0 Spec section 9.3, table 9-2.  See the\n USB spec for a fuller description of the different fields, and what they are\n used for.\n\n Note that the driver for any interface can issue control requests.\n For most devices, interfaces don't coordinate with each other, so\n such requests may be made at any time."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_ctrlrequest {
    pub bRequestType: __u8,
    pub bRequest: __u8,
    pub wValue: __le16,
    pub wIndex: __le16,
    pub wLength: __le16,
}
#[test]
fn bindgen_test_layout_usb_ctrlrequest() {
    const UNINIT: ::std::mem::MaybeUninit<usb_ctrlrequest> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_ctrlrequest>(),
        8usize,
        concat!("Size of: ", stringify!(usb_ctrlrequest))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_ctrlrequest>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_ctrlrequest))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bRequestType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ctrlrequest),
            "::",
            stringify!(bRequestType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bRequest) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ctrlrequest),
            "::",
            stringify!(bRequest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wValue) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ctrlrequest),
            "::",
            stringify!(wValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ctrlrequest),
            "::",
            stringify!(wIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wLength) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ctrlrequest),
            "::",
            stringify!(wLength)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_descriptor_header {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
}
#[test]
fn bindgen_test_layout_usb_descriptor_header() {
    const UNINIT: ::std::mem::MaybeUninit<usb_descriptor_header> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_descriptor_header>(),
        2usize,
        concat!("Size of: ", stringify!(usb_descriptor_header))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_descriptor_header>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_descriptor_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_descriptor_header),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_descriptor_header),
            "::",
            stringify!(bDescriptorType)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_device_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bcdUSB: __le16,
    pub bDeviceClass: __u8,
    pub bDeviceSubClass: __u8,
    pub bDeviceProtocol: __u8,
    pub bMaxPacketSize0: __u8,
    pub idVendor: __le16,
    pub idProduct: __le16,
    pub bcdDevice: __le16,
    pub iManufacturer: __u8,
    pub iProduct: __u8,
    pub iSerialNumber: __u8,
    pub bNumConfigurations: __u8,
}
#[test]
fn bindgen_test_layout_usb_device_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_device_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_device_descriptor>(),
        18usize,
        concat!("Size of: ", stringify!(usb_device_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_device_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_device_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bcdUSB) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(bcdUSB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDeviceClass) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(bDeviceClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDeviceSubClass) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(bDeviceSubClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDeviceProtocol) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(bDeviceProtocol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMaxPacketSize0) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(bMaxPacketSize0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idVendor) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(idVendor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idProduct) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(idProduct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bcdDevice) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(bcdDevice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iManufacturer) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(iManufacturer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iProduct) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(iProduct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iSerialNumber) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(iSerialNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNumConfigurations) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_device_descriptor),
            "::",
            stringify!(bNumConfigurations)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_config_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub wTotalLength: __le16,
    pub bNumInterfaces: __u8,
    pub bConfigurationValue: __u8,
    pub iConfiguration: __u8,
    pub bmAttributes: __u8,
    pub bMaxPower: __u8,
}
#[test]
fn bindgen_test_layout_usb_config_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_config_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_config_descriptor>(),
        9usize,
        concat!("Size of: ", stringify!(usb_config_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_config_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_config_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wTotalLength) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(wTotalLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNumInterfaces) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bNumInterfaces)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bConfigurationValue) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bConfigurationValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iConfiguration) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(iConfiguration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMaxPower) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bMaxPower)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_string_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub wData: [__le16; 1usize],
}
#[test]
fn bindgen_test_layout_usb_string_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_string_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_string_descriptor>(),
        4usize,
        concat!("Size of: ", stringify!(usb_string_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_string_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_string_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_string_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_string_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wData) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_string_descriptor),
            "::",
            stringify!(wData)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_interface_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bInterfaceNumber: __u8,
    pub bAlternateSetting: __u8,
    pub bNumEndpoints: __u8,
    pub bInterfaceClass: __u8,
    pub bInterfaceSubClass: __u8,
    pub bInterfaceProtocol: __u8,
    pub iInterface: __u8,
}
#[test]
fn bindgen_test_layout_usb_interface_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_interface_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_interface_descriptor>(),
        9usize,
        concat!("Size of: ", stringify!(usb_interface_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_interface_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_interface_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bInterfaceNumber) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bInterfaceNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bAlternateSetting) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bAlternateSetting)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNumEndpoints) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bNumEndpoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bInterfaceClass) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bInterfaceClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bInterfaceSubClass) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bInterfaceSubClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bInterfaceProtocol) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bInterfaceProtocol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iInterface) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(iInterface)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_endpoint_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bEndpointAddress: __u8,
    pub bmAttributes: __u8,
    pub wMaxPacketSize: __le16,
    pub bInterval: __u8,
    pub bRefresh: __u8,
    pub bSynchAddress: __u8,
}
#[test]
fn bindgen_test_layout_usb_endpoint_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_endpoint_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_endpoint_descriptor>(),
        9usize,
        concat!("Size of: ", stringify!(usb_endpoint_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_endpoint_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_endpoint_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bEndpointAddress) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bEndpointAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wMaxPacketSize) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(wMaxPacketSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bInterval) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bInterval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bRefresh) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bRefresh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bSynchAddress) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bSynchAddress)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_ssp_isoc_ep_comp_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub wReseved: __le16,
    pub dwBytesPerInterval: __le32,
}
#[test]
fn bindgen_test_layout_usb_ssp_isoc_ep_comp_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_ssp_isoc_ep_comp_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_ssp_isoc_ep_comp_descriptor>(),
        8usize,
        concat!("Size of: ", stringify!(usb_ssp_isoc_ep_comp_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_ssp_isoc_ep_comp_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_ssp_isoc_ep_comp_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_isoc_ep_comp_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_isoc_ep_comp_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wReseved) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_isoc_ep_comp_descriptor),
            "::",
            stringify!(wReseved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwBytesPerInterval) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_isoc_ep_comp_descriptor),
            "::",
            stringify!(dwBytesPerInterval)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_ss_ep_comp_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bMaxBurst: __u8,
    pub bmAttributes: __u8,
    pub wBytesPerInterval: __le16,
}
#[test]
fn bindgen_test_layout_usb_ss_ep_comp_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_ss_ep_comp_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_ss_ep_comp_descriptor>(),
        6usize,
        concat!("Size of: ", stringify!(usb_ss_ep_comp_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_ss_ep_comp_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_ss_ep_comp_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_ep_comp_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_ep_comp_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMaxBurst) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_ep_comp_descriptor),
            "::",
            stringify!(bMaxBurst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_ep_comp_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wBytesPerInterval) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_ep_comp_descriptor),
            "::",
            stringify!(wBytesPerInterval)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_qualifier_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bcdUSB: __le16,
    pub bDeviceClass: __u8,
    pub bDeviceSubClass: __u8,
    pub bDeviceProtocol: __u8,
    pub bMaxPacketSize0: __u8,
    pub bNumConfigurations: __u8,
    pub bRESERVED: __u8,
}
#[test]
fn bindgen_test_layout_usb_qualifier_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_qualifier_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_qualifier_descriptor>(),
        10usize,
        concat!("Size of: ", stringify!(usb_qualifier_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_qualifier_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_qualifier_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_qualifier_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_qualifier_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bcdUSB) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_qualifier_descriptor),
            "::",
            stringify!(bcdUSB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDeviceClass) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_qualifier_descriptor),
            "::",
            stringify!(bDeviceClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDeviceSubClass) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_qualifier_descriptor),
            "::",
            stringify!(bDeviceSubClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDeviceProtocol) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_qualifier_descriptor),
            "::",
            stringify!(bDeviceProtocol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMaxPacketSize0) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_qualifier_descriptor),
            "::",
            stringify!(bMaxPacketSize0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNumConfigurations) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_qualifier_descriptor),
            "::",
            stringify!(bNumConfigurations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bRESERVED) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_qualifier_descriptor),
            "::",
            stringify!(bRESERVED)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_otg_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bmAttributes: __u8,
}
#[test]
fn bindgen_test_layout_usb_otg_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_otg_descriptor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_otg_descriptor>(),
        3usize,
        concat!("Size of: ", stringify!(usb_otg_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_otg_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_otg_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_otg_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_otg_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_otg_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_otg20_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bmAttributes: __u8,
    pub bcdOTG: __le16,
}
#[test]
fn bindgen_test_layout_usb_otg20_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_otg20_descriptor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_otg20_descriptor>(),
        5usize,
        concat!("Size of: ", stringify!(usb_otg20_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_otg20_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_otg20_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_otg20_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_otg20_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_otg20_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bcdOTG) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_otg20_descriptor),
            "::",
            stringify!(bcdOTG)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_debug_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDebugInEndpoint: __u8,
    pub bDebugOutEndpoint: __u8,
}
#[test]
fn bindgen_test_layout_usb_debug_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_debug_descriptor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_debug_descriptor>(),
        4usize,
        concat!("Size of: ", stringify!(usb_debug_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_debug_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_debug_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_debug_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_debug_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDebugInEndpoint) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_debug_descriptor),
            "::",
            stringify!(bDebugInEndpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDebugOutEndpoint) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_debug_descriptor),
            "::",
            stringify!(bDebugOutEndpoint)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_interface_assoc_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bFirstInterface: __u8,
    pub bInterfaceCount: __u8,
    pub bFunctionClass: __u8,
    pub bFunctionSubClass: __u8,
    pub bFunctionProtocol: __u8,
    pub iFunction: __u8,
}
#[test]
fn bindgen_test_layout_usb_interface_assoc_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_interface_assoc_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_interface_assoc_descriptor>(),
        8usize,
        concat!("Size of: ", stringify!(usb_interface_assoc_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_interface_assoc_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_interface_assoc_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_assoc_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_assoc_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bFirstInterface) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_assoc_descriptor),
            "::",
            stringify!(bFirstInterface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bInterfaceCount) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_assoc_descriptor),
            "::",
            stringify!(bInterfaceCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bFunctionClass) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_assoc_descriptor),
            "::",
            stringify!(bFunctionClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bFunctionSubClass) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_assoc_descriptor),
            "::",
            stringify!(bFunctionSubClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bFunctionProtocol) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_assoc_descriptor),
            "::",
            stringify!(bFunctionProtocol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iFunction) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_assoc_descriptor),
            "::",
            stringify!(iFunction)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_security_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub wTotalLength: __le16,
    pub bNumEncryptionTypes: __u8,
}
#[test]
fn bindgen_test_layout_usb_security_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_security_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_security_descriptor>(),
        5usize,
        concat!("Size of: ", stringify!(usb_security_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_security_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_security_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_security_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_security_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wTotalLength) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_security_descriptor),
            "::",
            stringify!(wTotalLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNumEncryptionTypes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_security_descriptor),
            "::",
            stringify!(bNumEncryptionTypes)
        )
    );
}
#[repr(C, packed)]
pub struct usb_key_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub tTKID: [__u8; 3usize],
    pub bReserved: __u8,
    pub bKeyData: __IncompleteArrayField<__u8>,
}
#[test]
fn bindgen_test_layout_usb_key_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_key_descriptor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_key_descriptor>(),
        6usize,
        concat!("Size of: ", stringify!(usb_key_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_key_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_key_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_key_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_key_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tTKID) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_key_descriptor),
            "::",
            stringify!(tTKID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_key_descriptor),
            "::",
            stringify!(bReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bKeyData) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_key_descriptor),
            "::",
            stringify!(bKeyData)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_encryption_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bEncryptionType: __u8,
    pub bEncryptionValue: __u8,
    pub bAuthKeyIndex: __u8,
}
#[test]
fn bindgen_test_layout_usb_encryption_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_encryption_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_encryption_descriptor>(),
        5usize,
        concat!("Size of: ", stringify!(usb_encryption_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_encryption_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_encryption_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_encryption_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_encryption_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bEncryptionType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_encryption_descriptor),
            "::",
            stringify!(bEncryptionType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bEncryptionValue) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_encryption_descriptor),
            "::",
            stringify!(bEncryptionValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bAuthKeyIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_encryption_descriptor),
            "::",
            stringify!(bAuthKeyIndex)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_bos_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub wTotalLength: __le16,
    pub bNumDeviceCaps: __u8,
}
#[test]
fn bindgen_test_layout_usb_bos_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_bos_descriptor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_bos_descriptor>(),
        5usize,
        concat!("Size of: ", stringify!(usb_bos_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_bos_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_bos_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_bos_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_bos_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wTotalLength) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_bos_descriptor),
            "::",
            stringify!(wTotalLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNumDeviceCaps) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_bos_descriptor),
            "::",
            stringify!(bNumDeviceCaps)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_dev_cap_header {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
}
#[test]
fn bindgen_test_layout_usb_dev_cap_header() {
    const UNINIT: ::std::mem::MaybeUninit<usb_dev_cap_header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_dev_cap_header>(),
        3usize,
        concat!("Size of: ", stringify!(usb_dev_cap_header))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_dev_cap_header>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_dev_cap_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_dev_cap_header),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_dev_cap_header),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_dev_cap_header),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_wireless_cap_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub bmAttributes: __u8,
    pub wPHYRates: __le16,
    pub bmTFITXPowerInfo: __u8,
    pub bmFFITXPowerInfo: __u8,
    pub bmBandGroup: __le16,
    pub bReserved: __u8,
}
#[test]
fn bindgen_test_layout_usb_wireless_cap_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_wireless_cap_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_wireless_cap_descriptor>(),
        11usize,
        concat!("Size of: ", stringify!(usb_wireless_cap_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_wireless_cap_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_wireless_cap_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_cap_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_cap_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_cap_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_cap_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wPHYRates) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_cap_descriptor),
            "::",
            stringify!(wPHYRates)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmTFITXPowerInfo) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_cap_descriptor),
            "::",
            stringify!(bmTFITXPowerInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmFFITXPowerInfo) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_cap_descriptor),
            "::",
            stringify!(bmFFITXPowerInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmBandGroup) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_cap_descriptor),
            "::",
            stringify!(bmBandGroup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_cap_descriptor),
            "::",
            stringify!(bReserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_ext_cap_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub bmAttributes: __le32,
}
#[test]
fn bindgen_test_layout_usb_ext_cap_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_ext_cap_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_ext_cap_descriptor>(),
        7usize,
        concat!("Size of: ", stringify!(usb_ext_cap_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_ext_cap_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_ext_cap_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ext_cap_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ext_cap_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ext_cap_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ext_cap_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_ss_cap_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub bmAttributes: __u8,
    pub wSpeedSupported: __le16,
    pub bFunctionalitySupport: __u8,
    pub bU1devExitLat: __u8,
    pub bU2DevExitLat: __le16,
}
#[test]
fn bindgen_test_layout_usb_ss_cap_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_ss_cap_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_ss_cap_descriptor>(),
        10usize,
        concat!("Size of: ", stringify!(usb_ss_cap_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_ss_cap_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_ss_cap_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_cap_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_cap_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_cap_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_cap_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wSpeedSupported) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_cap_descriptor),
            "::",
            stringify!(wSpeedSupported)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bFunctionalitySupport) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_cap_descriptor),
            "::",
            stringify!(bFunctionalitySupport)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bU1devExitLat) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_cap_descriptor),
            "::",
            stringify!(bU1devExitLat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bU2DevExitLat) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_cap_descriptor),
            "::",
            stringify!(bU2DevExitLat)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_ss_container_id_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub bReserved: __u8,
    pub ContainerID: [__u8; 16usize],
}
#[test]
fn bindgen_test_layout_usb_ss_container_id_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_ss_container_id_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_ss_container_id_descriptor>(),
        20usize,
        concat!("Size of: ", stringify!(usb_ss_container_id_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_ss_container_id_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_ss_container_id_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_container_id_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_container_id_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_container_id_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_container_id_descriptor),
            "::",
            stringify!(bReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ContainerID) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ss_container_id_descriptor),
            "::",
            stringify!(ContainerID)
        )
    );
}
#[repr(C, packed)]
pub struct usb_plat_dev_cap_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub bReserved: __u8,
    pub UUID: [__u8; 16usize],
    pub CapabilityData: __IncompleteArrayField<__u8>,
}
#[test]
fn bindgen_test_layout_usb_plat_dev_cap_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_plat_dev_cap_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_plat_dev_cap_descriptor>(),
        20usize,
        concat!("Size of: ", stringify!(usb_plat_dev_cap_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_plat_dev_cap_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_plat_dev_cap_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_plat_dev_cap_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_plat_dev_cap_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_plat_dev_cap_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_plat_dev_cap_descriptor),
            "::",
            stringify!(bReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UUID) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_plat_dev_cap_descriptor),
            "::",
            stringify!(UUID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CapabilityData) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_plat_dev_cap_descriptor),
            "::",
            stringify!(CapabilityData)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_ssp_cap_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub bReserved: __u8,
    pub bmAttributes: __le32,
    pub wFunctionalitySupport: __le16,
    pub wReserved: __le16,
    pub bmSublinkSpeedAttr: [__le32; 1usize],
}
#[test]
fn bindgen_test_layout_usb_ssp_cap_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_ssp_cap_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_ssp_cap_descriptor>(),
        16usize,
        concat!("Size of: ", stringify!(usb_ssp_cap_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_ssp_cap_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_ssp_cap_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_cap_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_cap_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_cap_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_cap_descriptor),
            "::",
            stringify!(bReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_cap_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wFunctionalitySupport) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_cap_descriptor),
            "::",
            stringify!(wFunctionalitySupport)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wReserved) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_cap_descriptor),
            "::",
            stringify!(wReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmSublinkSpeedAttr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ssp_cap_descriptor),
            "::",
            stringify!(bmSublinkSpeedAttr)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_pd_cap_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub bReserved: __u8,
    pub bmAttributes: __le32,
    pub bmProviderPorts: __le16,
    pub bmConsumerPorts: __le16,
    pub bcdBCVersion: __le16,
    pub bcdPDVersion: __le16,
    pub bcdUSBTypeCVersion: __le16,
}
#[test]
fn bindgen_test_layout_usb_pd_cap_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_pd_cap_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_pd_cap_descriptor>(),
        18usize,
        concat!("Size of: ", stringify!(usb_pd_cap_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_pd_cap_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_pd_cap_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmProviderPorts) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bmProviderPorts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmConsumerPorts) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bmConsumerPorts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bcdBCVersion) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bcdBCVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bcdPDVersion) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bcdPDVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bcdUSBTypeCVersion) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_descriptor),
            "::",
            stringify!(bcdUSBTypeCVersion)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_pd_cap_battery_info_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub iBattery: __u8,
    pub iSerial: __u8,
    pub iManufacturer: __u8,
    pub bBatteryId: __u8,
    pub bReserved: __u8,
    pub dwChargedThreshold: __le32,
    pub dwWeakThreshold: __le32,
    pub dwBatteryDesignCapacity: __le32,
    pub dwBatteryLastFullchargeCapacity: __le32,
}
#[test]
fn bindgen_test_layout_usb_pd_cap_battery_info_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_pd_cap_battery_info_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_pd_cap_battery_info_descriptor>(),
        24usize,
        concat!("Size of: ", stringify!(usb_pd_cap_battery_info_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_pd_cap_battery_info_descriptor>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(usb_pd_cap_battery_info_descriptor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iBattery) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(iBattery)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iSerial) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(iSerial)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iManufacturer) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(iManufacturer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bBatteryId) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(bBatteryId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(bReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwChargedThreshold) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(dwChargedThreshold)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwWeakThreshold) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(dwWeakThreshold)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwBatteryDesignCapacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(dwBatteryDesignCapacity)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).dwBatteryLastFullchargeCapacity) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_battery_info_descriptor),
            "::",
            stringify!(dwBatteryLastFullchargeCapacity)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_pd_cap_consumer_port_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub bReserved: __u8,
    pub bmCapabilities: __u8,
    pub wMinVoltage: __le16,
    pub wMaxVoltage: __le16,
    pub wReserved: __u16,
    pub dwMaxOperatingPower: __le32,
    pub dwMaxPeakPower: __le32,
    pub dwMaxPeakPowerTime: __le32,
}
#[test]
fn bindgen_test_layout_usb_pd_cap_consumer_port_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_pd_cap_consumer_port_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_pd_cap_consumer_port_descriptor>(),
        23usize,
        concat!("Size of: ", stringify!(usb_pd_cap_consumer_port_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_pd_cap_consumer_port_descriptor>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(usb_pd_cap_consumer_port_descriptor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(bReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmCapabilities) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(bmCapabilities)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wMinVoltage) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(wMinVoltage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wMaxVoltage) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(wMaxVoltage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wReserved) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(wReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwMaxOperatingPower) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(dwMaxOperatingPower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwMaxPeakPower) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(dwMaxPeakPower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwMaxPeakPowerTime) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_consumer_port_descriptor),
            "::",
            stringify!(dwMaxPeakPowerTime)
        )
    );
}
#[repr(C, packed)]
pub struct usb_pd_cap_provider_port_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
    pub bReserved1: __u8,
    pub bmCapabilities: __u8,
    pub bNumOfPDObjects: __u8,
    pub bReserved2: __u8,
    pub wPowerDataObject: __IncompleteArrayField<__le32>,
}
#[test]
fn bindgen_test_layout_usb_pd_cap_provider_port_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_pd_cap_provider_port_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_pd_cap_provider_port_descriptor>(),
        7usize,
        concat!("Size of: ", stringify!(usb_pd_cap_provider_port_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_pd_cap_provider_port_descriptor>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(usb_pd_cap_provider_port_descriptor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_provider_port_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_provider_port_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_provider_port_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved1) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_provider_port_descriptor),
            "::",
            stringify!(bReserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmCapabilities) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_provider_port_descriptor),
            "::",
            stringify!(bmCapabilities)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNumOfPDObjects) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_provider_port_descriptor),
            "::",
            stringify!(bNumOfPDObjects)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved2) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_provider_port_descriptor),
            "::",
            stringify!(bReserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wPowerDataObject) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_pd_cap_provider_port_descriptor),
            "::",
            stringify!(wPowerDataObject)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_ptm_cap_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bDevCapabilityType: __u8,
}
#[test]
fn bindgen_test_layout_usb_ptm_cap_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_ptm_cap_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_ptm_cap_descriptor>(),
        3usize,
        concat!("Size of: ", stringify!(usb_ptm_cap_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_ptm_cap_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_ptm_cap_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ptm_cap_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ptm_cap_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDevCapabilityType) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_ptm_cap_descriptor),
            "::",
            stringify!(bDevCapabilityType)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_wireless_ep_comp_descriptor {
    pub bLength: __u8,
    pub bDescriptorType: __u8,
    pub bMaxBurst: __u8,
    pub bMaxSequence: __u8,
    pub wMaxStreamDelay: __le16,
    pub wOverTheAirPacketSize: __le16,
    pub bOverTheAirInterval: __u8,
    pub bmCompAttributes: __u8,
}
#[test]
fn bindgen_test_layout_usb_wireless_ep_comp_descriptor() {
    const UNINIT: ::std::mem::MaybeUninit<usb_wireless_ep_comp_descriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_wireless_ep_comp_descriptor>(),
        10usize,
        concat!("Size of: ", stringify!(usb_wireless_ep_comp_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_wireless_ep_comp_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_wireless_ep_comp_descriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_ep_comp_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_ep_comp_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMaxBurst) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_ep_comp_descriptor),
            "::",
            stringify!(bMaxBurst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMaxSequence) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_ep_comp_descriptor),
            "::",
            stringify!(bMaxSequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wMaxStreamDelay) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_ep_comp_descriptor),
            "::",
            stringify!(wMaxStreamDelay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wOverTheAirPacketSize) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_ep_comp_descriptor),
            "::",
            stringify!(wOverTheAirPacketSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bOverTheAirInterval) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_ep_comp_descriptor),
            "::",
            stringify!(bOverTheAirInterval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bmCompAttributes) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_wireless_ep_comp_descriptor),
            "::",
            stringify!(bmCompAttributes)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_handshake {
    pub bMessageNumber: __u8,
    pub bStatus: __u8,
    pub tTKID: [__u8; 3usize],
    pub bReserved: __u8,
    pub CDID: [__u8; 16usize],
    pub nonce: [__u8; 16usize],
    pub MIC: [__u8; 8usize],
}
#[test]
fn bindgen_test_layout_usb_handshake() {
    const UNINIT: ::std::mem::MaybeUninit<usb_handshake> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_handshake>(),
        46usize,
        concat!("Size of: ", stringify!(usb_handshake))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_handshake>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_handshake))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMessageNumber) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_handshake),
            "::",
            stringify!(bMessageNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bStatus) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_handshake),
            "::",
            stringify!(bStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tTKID) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_handshake),
            "::",
            stringify!(tTKID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReserved) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_handshake),
            "::",
            stringify!(bReserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CDID) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_handshake),
            "::",
            stringify!(CDID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nonce) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_handshake),
            "::",
            stringify!(nonce)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MIC) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_handshake),
            "::",
            stringify!(MIC)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_connection_context {
    pub CHID: [__u8; 16usize],
    pub CDID: [__u8; 16usize],
    pub CK: [__u8; 16usize],
}
#[test]
fn bindgen_test_layout_usb_connection_context() {
    const UNINIT: ::std::mem::MaybeUninit<usb_connection_context> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_connection_context>(),
        48usize,
        concat!("Size of: ", stringify!(usb_connection_context))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_connection_context>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_connection_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CHID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_connection_context),
            "::",
            stringify!(CHID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CDID) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_connection_context),
            "::",
            stringify!(CDID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CK) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_connection_context),
            "::",
            stringify!(CK)
        )
    );
}
pub const usb_device_speed_USB_SPEED_UNKNOWN: usb_device_speed = 0;
pub const usb_device_speed_USB_SPEED_LOW: usb_device_speed = 1;
pub const usb_device_speed_USB_SPEED_FULL: usb_device_speed = 2;
pub const usb_device_speed_USB_SPEED_HIGH: usb_device_speed = 3;
pub const usb_device_speed_USB_SPEED_WIRELESS: usb_device_speed = 4;
pub const usb_device_speed_USB_SPEED_SUPER: usb_device_speed = 5;
pub const usb_device_speed_USB_SPEED_SUPER_PLUS: usb_device_speed = 6;
pub type usb_device_speed = ::std::os::raw::c_uint;
pub const usb_device_state_USB_STATE_NOTATTACHED: usb_device_state = 0;
pub const usb_device_state_USB_STATE_ATTACHED: usb_device_state = 1;
pub const usb_device_state_USB_STATE_POWERED: usb_device_state = 2;
pub const usb_device_state_USB_STATE_RECONNECTING: usb_device_state = 3;
pub const usb_device_state_USB_STATE_UNAUTHENTICATED: usb_device_state = 4;
pub const usb_device_state_USB_STATE_DEFAULT: usb_device_state = 5;
pub const usb_device_state_USB_STATE_ADDRESS: usb_device_state = 6;
pub const usb_device_state_USB_STATE_CONFIGURED: usb_device_state = 7;
pub const usb_device_state_USB_STATE_SUSPENDED: usb_device_state = 8;
pub type usb_device_state = ::std::os::raw::c_uint;
pub const usb3_link_state_USB3_LPM_U0: usb3_link_state = 0;
pub const usb3_link_state_USB3_LPM_U1: usb3_link_state = 1;
pub const usb3_link_state_USB3_LPM_U2: usb3_link_state = 2;
pub const usb3_link_state_USB3_LPM_U3: usb3_link_state = 3;
pub type usb3_link_state = ::std::os::raw::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_set_sel_req {
    pub u1_sel: __u8,
    pub u1_pel: __u8,
    pub u2_sel: __le16,
    pub u2_pel: __le16,
}
#[test]
fn bindgen_test_layout_usb_set_sel_req() {
    const UNINIT: ::std::mem::MaybeUninit<usb_set_sel_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<usb_set_sel_req>(),
        6usize,
        concat!("Size of: ", stringify!(usb_set_sel_req))
    );
    assert_eq!(
        ::std::mem::align_of::<usb_set_sel_req>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_set_sel_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u1_sel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_set_sel_req),
            "::",
            stringify!(u1_sel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u1_pel) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_set_sel_req),
            "::",
            stringify!(u1_pel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u2_sel) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_set_sel_req),
            "::",
            stringify!(u2_sel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u2_pel) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_set_sel_req),
            "::",
            stringify!(u2_pel)
        )
    );
}
